/* const execute = () => {
  console.log(task);
  for (let i = 1; i < 4; i += 1) {
    const call = здесь вызов функции нужной игры
    if (call === 'Correct!') {
      console.log('Correct!');
      if (i === 3) {
        return (`Congratulations, ${userName} !`);
      }
    } else {
      return call;
    }
  }
};

не знаю, как организовать общую логику. функция вызова получилась универсальная,
 однако возможно ли сделать так, чтобы вызов функции с нужной игрой передавался в качестве
 аргумента универсальной функции? сделать я так не смог во всяком случае.

*/
